Repository: Piwigo/Piwigo-Mobile
Catalog: piwigo/Resources/ReleaseNotes.xcstrings
Source language: en
Languages: ar, da, de, es, fr, hu, id, it, ja, nl, pl, ru, sv, zh_hans, zh_hant

# v2.12.0_text
source: Version 2.12 July 3, 2022 • Select a tag faster with the search bar • Code modernization • Bug fixes
ar: الإصدار 2.12 3 يوليو 2022 • حدد علامة بشكل أسرع باستخدام شريط البحث • تحديث الكود • إصلاح الأخطاء
da: Version 2.12 3 juli 2022 • Vælg et tag hurtigere med søgelinjen • Modernisering af kode • Fejlrettelser
de: Version 2.12 3. Juli 2022 • Wählen Sie ein Schlagwort schneller mit der Suchleiste aus • Code-Modernisierung • Fehlerbehebungen
es: Versión 2.12 3 de julio de 2022 • Selecciona una etiqueta más rápido con la barra de búsqueda • Modernización del código • Corrección de errores
fr: Version 2.12 3 juillet 2022 • Sélectionnez un tag plus rapidement avec la barre de recherche • Modernisation du code • Corrections de bugs
hu: 2.12-es verzió 2022 Július 3 • Gyorsabban válasszon címkét a keresősávval • Kódmodernizáció • Hibajavítások
it: Versione 2.12 3 luglio 2022 • Seleziona un tag più velocemente con la barra di ricerca • Modernizzazione del codice • Correzioni di bug
ja: バージョン 2.12 2022年7月3日 • 検索バーでタグを高速に選択する • コードの近代化 • バグの修正
nl: Versie 2.12 3 juli 2022 • Selecteer een label sneller met de zoekbalk • Code-modernisering • Foutjes verbeterd
pl: Wersja 2.12 3 lipca 2022 • Wybierz tag szybciej z paskiem wyszukiwania • Modernizacja kodu • Poprawki błędów
ru: Версия 2.12 3 июля 2022 • Быстрый выбор тега с помощью панели поиска • Модернизация кода • Исправления ошибок
sv: Version 2.12 3 juli 2022 • Välj en tagg snabbare med sökfältet • Uppdatering av kod • Buggfixar
zh_hans: 版本 2.12 2022 年 7 月 3 日 • 使用搜索栏更快地选择标签 • 代码现代化 • Bug修复
zh_hant: 版本 2.12 2022年7月3日 • 可以用搜尋更快的選取標籤 • 程式碼更新 • 錯誤修正

# v2.12.1_text
source: Version 2.12.1 July 10, 2022 • Fixes a crash occurring on iOS 9-13 when changing tags allocated to photos
ar: الإصدار 2.12.1 10 يوليو 2022 • إصلاح تعطل يحدث على نظام التشغيل iOS 9-13 عند تغيير العلامات المخصصة للصور
da: Version 2.12.1 10 juli 2022 • Retter et nedbrud, der opstår på iOS 9-13 ved ændring af tags tildelt billeder
de: Version 2.12.1 10. Juli 2022 • Behebt einen Absturz auf iOS 9-13 beim Ändern von Schlagwörtern, die Fotos zugeordnet sind
es: Versión 2.12.1 10 de julio de 2022 • Corrige un bloqueo en iOS 9-13 al cambiar las etiquetas asignadas a las fotos
fr: Version 2.12.1 10 juillet 2022 • Corrige un crash survenant sur iOS 9-13 lors de la modification des balises attribuées aux photos
hu: 2.12.1 verzió 2022 Július 10 • Kijavítja az iOS 9–13 rendszeren előforduló összeomlást, amikor módosítja a fényképekhez rendelt címkéket
it: Versione 2.12.1 10 luglio 2022 • Risolve un arresto anomalo che si verificava su iOS 9-13 durante la modifica dei tag assegnati alle foto
ja: バージョン 2.12.1 2022年7月10日 • 写真に割り当てられたタグを変更するとiOS 9-13でクラッシュする問題を修正。
nl: Versie 2.12.1 10 juli 2022 • Corrigeert een crash die optreedt op iOS 9-13 bij het veranderen van labels toegewezen aan foto's
pl: Wersja 2.12.1 10 lipca 2022 • Naprawia awarię w iOS 9-13 występującą podczas zmiany tagów przypisanych do zdjęć
ru: Версия 2.12.1 10 июля 2022 • Исправлена ошибка, возникающая на iOS 9-13 при изменении тегов, выделенных на фотографии
sv: Version 2.12.1 10 juli 2022 • Fixar en krasch som inträffar på iOS 9-13 vid ändring av taggar som tilldelats foton
zh_hans: 版本 2.12.1 • 修复了在 iOS 9-13 上更改分配给照片的标签时发生的崩溃
zh_hant: 版本 2.12.1 2022年7月10日 • 修正了在 iOS 9-13 上更改分配給照片的標籤時發生的閃退

# v2.12.2_text
source: Version 2.12.2 August 2, 2022 • Fixes a crash occurring on iOS 9-12 when displaying the upload request queue • Minor bug fixes and improvements of the interface
ar: الإصدار 2.12.2 2 أغسطس 2022 • إصلاح تعطل يحدث على نظام التشغيل iOS 9-12 عند عرض قائمة انتظار طلبات التحميل • إصلاحات أخطاء طفيفة وتحسينات في الواجهة
da: Version 2.12.2 2 august 2022 • Løser et nedbrud på iOS 9-12, ved visning upload anmodnings kø • Mindre fejlrettelser og forbedringer af brugerflade
de: Version 2.12.2 2. August 2022 • Behebt einen Absturz, der bei iOS 9 - 12 auftritt, wenn die Warteschlange für Upload-Anfragen angezeigt wird • Kleinere Fehlerbehebungen und Verbesserungen der Schnittstelle
es: Versión 2.12.2 2 de agosto de 2022 • Corrige un error que ocurría en iOS 9-12 al mostrar la cola de peticiones de subida • Corrección de errores menores y mejoras en la interfaz
fr: Version 2.12.2 2 août 2022 • Corrige un crash survenant sur iOS 9-12 lors de l'affichage de la file d'attente des demandes de téléchargement • Corrections de bugs mineurs et améliorations de l'interface
hu: 2.12.2 verzió 2022 Augusztus 2 • Kijavítja az iOS 9–12 rendszeren előforduló összeomlást a feltöltési kéréssor megjelenítésekor • Kisebb hibajavítások és fejlesztések a felületen
it: Versione 2.12.2 2 agosto 2022 • Corregge un arresto anomalo che si verifica su iOS 9-12 quando si visualizza la coda di richiesta di caricamento • Correzioni di bug minori e miglioramenti dell'interfaccia
ja: バージョン 2.12.2 2022年8月2日 • アップロードリクエストキューを表示するときにiOS 9-12で発生するクラッシュを修正 • 軽微なバグの修正とインターフェースの改善
nl: Versie 2.12.2 2 augustus 2022 • Lost een crash op die optreedt op iOS 9-12 wanneer de wachtrij voor de upload aanvraag wordt weergegeven • Kleine foutjes hersteld en verbetering van de interface
pl: Wersja 2.12.2 2 sierpnia 2022 • Naprawia awarię w iOS 9-12 podczas wyświetlania kolejki żądań przesyłania • Drobne poprawki błędów i ulepszenia interfejsu
ru: Версия 2.12.2 2 августа 2022 • Исправлена ошибка на iOS 9-12 при отображении очереди запросов на загрузку • Исправления мелких ошибок и улучшения интерфейса
sv: Version 2.12.2 2 augusti 2022 • Fixar en krasch som inträffar på iOS 9-12 när du visar uppladdningskön • Mindre bugfixar och förbättringar av gränssnittet
zh_hans: 版本 2.12.2 2022年8月2日 • 修复了在 iOS 9-12 上显示上传请求队列时发生的崩溃 • 小错误修复和界面改进
zh_hant: 版本 2.12.2 2022年8月2日 • 修正在iOS 9-12上顯示上傳請求隊列時會發生的閃退 • 小型錯誤修正及介面改進

# v2.12.3_text
source: Version 2.12.3 August 7, 2022 • Bug fixes
ar: الإصدار 2.12.3 7 أغسطس 2022 • إصلاحات الأخطاء
da: Version 2.12.3 7 august 2022 • Fejlrettelser
de: Version 2.12.3 7. August 2022 • Fehlerbehebungen
es: Versión 2.12.3 7 de agosto de 2022 • Corrección de errores
fr: Version 2.12.3 7 août 2022 • Correction de bugs
hu: 2.12.3 verzió 2022 Augusztus 7 • Hibajavítások
id: Versi 2.12.3 7 Agustus, 2022 • Perbaikan bug
it: Versione 2.12.3 7 agosto 2022 • Correzioni di bug
ja: バージョン 2.12.3 2022年8月7日 • バグの修正
nl: Versie 2.12.3 7 augustus 2022 • Foutjes verbeterd
pl: Wersja 2.12.3 7 sierpnia 2022 • Poprawki błędów
ru: Версия 2.12.3 7 августа 2022 • Исправления ошибок
sv: Version 2.12.3 7 augusti 2022 • Buggfixar
zh_hans: 版本 2.12.3 2022年8月7日 • 错误修复
zh_hant: 版本 2.12.3 2022年8月7日 • 錯誤修正

# v2.12.4_text
source: Version 2.12.4 August 16, 2022 • Bug fixes
ar: الإصدار 2.12.4 • اصلاحات الشوائب
da: Version 2.12.4 16 august 2022 • Fejlrettelser
de: Version 2.12.4 16. August 2022 • Fehlerbehebungen
es: Versión 2.12.4 16 de agosto de 2022 • Corrección de errores
fr: Version 2.12.4 16 août 2022 • Correction de bugs
hu: 2.12.4 verzió 2022 Augusztus 16 • Hibajavítások
id: Versi 2.12.4 16 Agustus, 2022 • Perbaikan bug
it: Versione 2.12.4 16 agosto 2022 • Correzioni di bug
ja: バージョン 2.12.4 2022年8月16日 • バグの修正
nl: Versie 2.12.4 16 augustus 2022 • Foutjes verbeterd
pl: Wersja 2.12.4 16 sierpnia 2022 • Poprawki błędów
ru: Версия 2.12.4 16 августа 2022 • Исправления ошибок
sv: Version 2.12.4 16 augusti 2022 • Buggfixar
zh_hans: 版本 2.12.4 2022年8月16日 • 错误修复
zh_hant: 版本 2.12.4 2022年8月16日 • 錯誤修正

# v2.12.5_text
source: Version 2.12.5 August 26, 2022 • Bug fixes
ar: الإصدار 2.12.5 • اصلاحات الشوائب
da: Version 2.12.5 26 august 2022 • Fejlrettelser
de: Version 2.12.5 26. August 2022 • Fehlerbehebungen
es: Versión 2.12.5 26 de agosto de 2022 • Corrección de errores
fr: Version 2.12.5 26 août 2022 • Correction de bugs
hu: 2.12.5 verzió 2022 Augusztus 26 • Hibajavítások
id: Versi 2.12.5 • Perbaikan bug
it: Versione 2.12.5 26 agosto 2022 • Correzioni di bug
ja: バージョン 2.12.5 2022年8月26日 • バグの修正
nl: Versie 2.12.5 26 augustus 2022 • Foutjes verbeterd
pl: Wersja 2.12.5 26 sierpnia 2022 • Poprawki błędów
ru: Версия 2.12.5 26 августа 2022 • Исправления ошибок
sv: Version 2.12.5 26 augusti 2022 • Buggfixar
zh_hans: 版本 2.12.5 2022年8月26日 • 错误修复
zh_hant: 版本 2.12.5 2022年8月26日 • 錯誤修正

# v2.12.6_text
source: Version 2.12.6 November 21, 2022 • Bug fixes
ar: الإصدار 2.12.6 21 نوفمبر 2022 • إصلاحات الأخطاء
da: Version 2.12.6 21 november 2022 • Fejlrettelser
de: Version 2.12.6 21. November 2022 • Fehlerbehebungen
es: Versión 2.12.6 21 de noviembre de 2022 • Corrección de errores
fr: Version 2.12.6 21 novembre 2022 • Correction de bugs
hu: 2.12.6 verzió 2022 November 21 • Hibajavítások
it: Versione 2.12.6 21 novembre 2022 • Correzioni di bug
ja: バージョン 2.12.6 2022年11月21日 • バグの修正
nl: Versie 2.12.6 21 November 2022 • Foutjes verbeterd
pl: Wersja 2.12.6 21 listopada 2022 • Poprawki błędów
ru: Версия 2.12.6 21 ноября 2022 • Исправления ошибок
sv: Version 2.12.6 21 november 2022 • Buggfixar
zh_hans: 版本 2.12.6 2022年11月21日 • 错误修复
zh_hant: 版本 2.12.6 2022年11月21日 • 錯誤修正

# v2.12.7_text
source: Version 2.12.7 December 19, 2022 • Bug fixes
ar: الإصدار 2.12.7 19 ديسمبر 2022 • إصلاحات الأخطاء
da: Version 2.12.7 19 december 2022 • Fejlrettelser
de: Version 2.12.7 19. Dezember 2022 • Fehlerbehebungen
es: Versión 2.12.7 19 de diciembre de 2022 • Corrección de errores
fr: Version 2.12.7 19 décembre 2022 • Correction de bugs
hu: 2.12.7 verzió 2022 December 19 • Hibajavítások
it: Versione 2.12.7 19 dicembre 2022 • Correzioni di bug
ja: バージョン 2.12.7 2022年12月19日 • バグの修正
nl: Versie 2.12.7 19 December 2022 • Foutjes verbeterd
pl: Wersja 2.12.7 19 grudnia 2022 • Poprawki błędów
ru: Версия 2.12.7 19 февраля 2022 • Исправления ошибок
sv: Version 2.12.7 19 december 2022 • Buggfixar
zh_hans: 版本 2.12.7 2022年12月19日 • 错误修复
zh_hant: 版本 2.12.7 2022年12月19日 • 錯誤修正

# v3.0.0_text
source: Version 3.0 June 27, 2023 • Cache management fully rewritten to improve the user experience and bring offline browsing • Fixes some translations
ar: الإصدار 3.0 27 يونيو 2023 • تمت إعادة كتابة إدارة ذاكرة التخزين المؤقت بالكامل لتحسين تجربة المستخدم وإتاحة التصفح دون اتصال بالإنترنت • إصلاح بعض الترجمات
da: Version 3.0 27 juni 2023 • Cachehåndtering er fuldstændig omskrevet for at forbedre brugeroplevelsen og give mulighed for offline browsing • Retter af nogle oversættelser
de: Version 3.0 27. Juni 2023 • Die Cache-Verwaltung wurde vollständig überarbeitet, um die Benutzerfreundlichkeit zu verbessern und das Offline-Browsing zu ermöglichen • Korrekturen einiger Übersetzungen
es: Versión 3.0 27 de junio de 2023 • Gestión de caché completamente reescrita para mejorar la experiencia del usuario y traer la navegación sin conexión • Corrección de algunas traducciones
fr: Version 3.0 27 juin 2023 • Gestion du cache entièrement réécrite pour améliorer l'expérience de l'utilisateur et permettre la navigation hors ligne. • Correction de certaines traductions
hu: 3.0 verzió 2023. június 27 • A gyorsítótár-kezelés teljesen újraírva a felhasználói élmény javítása és az offline böngészés érdekében. • Néhány fordítás javítása
it: Versione 3.0 27 giugno 2023 • Gestione della cache completamente riscritta per migliorare l'esperienza dell'utente e portare la navigazione offline • Correzione di alcune traduzioni
ja: バージョン3.0 2023年6月27日 • キャッシュマネジメントを全面的に見直し、ユーザーエクスペリエンスの向上とオフラインブラウジングの実現を目指す • いくつかの翻訳を修正
nl: Versie 3.0 27 juni 2023 • Cache beheer volledig herschreven om de gebruikerservaring te verbeteren en offline browsen te brengen • Enkele vertalingen opgelost
pl: Wersja 3.0 27 czerwca 2023 • W całości przepisane zarządzanie pamięcią podręczną w celu poprawy komfortu użytkowania i umożliwienia przeglądania offline • Poprawki niektórych tłumaczeń
ru: Версия 3.0 27 июня 2023 • Полностью переписано управление кэшем для улучшения пользовательского опыта и обеспечения возможности автономного просмотра страниц • Исправлены некоторые переводы
sv: Version 3.0 27 juni 2023 • Cache-hanteringen är helt omskriven för att förbättra användarupplevelsen och göra det möjligt att surfa offline. • Korrigerar vissa översättningar
zh_hans: 版本 3.0 2023年6月27日 - 缓存管理全面重写，以改善用户体验并带来离线浏览功能 - 修复了一些翻译
zh_hant: 版本 3.0 2023年6月27日 • 全面重寫快取管理以增進使用者體驗及提供離線瀏覽 • 修正部分翻譯

# v3.0.1_text
source: Version 3.0.1 July 2, 2023 • Minor bug fixes and improvements of the interface
ar: الإصدار 3.0.1 2 يوليو 2023 • إصلاحات أخطاء طفيفة وتحسينات في الواجهة
da: Version 3.0.1 2 juli 2023 • Mindre fejl rettet og forbedringer af brugerflade
de: Version 3.0.1 2. Juli 2023 • Kleinere Fehlerbehebungen und Verbesserungen der Benutzeroberfläche
es: Versión 3.0.1 2 de julio de 2023 • Corrección de errores menores y mejoras en la interfaz
fr: Version 3.0.1 2 juillet 2023 • Corrections de bugs mineurs et amélioration de l'interface
hu: 3.0.1-es verzió 2023 Július 2 • Kisebb hibajavítások és fejlesztések a felületen
id: Versi 3.0.1 2 Juli 2023 • Perbaikan bug minor dan perbaikan antarmuka
it: Versione 3.0.1 2 luglio 2023 • Correzioni di bug minori e miglioramenti dell'interfaccia
ja: バージョン 3.0.1 2023年7月2日 • 軽微なバグの修正とインタフェースの改善
nl: Versie 3.0.1 2 juli 2023 • Kleine foutjes hersteld en verbetering van de interface
pl: Wersja 3.0.1 2 lipca 2023 • Poprawki drobnych błędów i ulepszenia interfejsu
ru: Версия 3.0.1 2 июля 2023 • Исправление незначительных ошибок и улучшения интерфейса
sv: Version 3.0.1 2 juli 2023 • Mindre bugfixar och förbättringar av gränssnittet
zh_hans: 版本 3.0.1 2023年7月2日 • 小错误修复和界面改进
zh_hant: 版本 3.0.1 2023年7月2日 • 小型錯誤修正及介面改進

# v3.0.2_text
source: Version 3.0.2 July 15, 2023 • Bug fixes
ar: الإصدار 3.0.2 15 يوليو 2023 • إصلاحات الأخطاء
da: Version 3.0.2 15 juli 2023 • Fejlrettelser
de: Version 3.0.2 15. Juli 2023 • Fehlerbehebungen
es: Versión 3.0.2 15 de julio de 2023 • Corrección de errores
fr: Version 3.0.2 15 juillet 2023 • Correction de bugs
hu: 3.0.2-es verzió 2023 Július 15 • Hibajavítások
id: Versi 3.0.2 • Perbaikan bug
it: Versione 3.0.2 15 luglio 2023 • Correzioni di bug
ja: バージョン 3.0.2 2023年7月15日 • バグの修正
nl: Versie 3.0.2 15 juli 2023 • Foutjes verbeterd
pl: Wersja 3.0.2 • Poprawki błędów
ru: Версия 3.0.2 15 июля 2023 • Исправления ошибок
sv: Version 3.0.2 15 juli 2023 • Buggfixar
zh_hans: 版本 3.0.2 2023年7月15日 • 错误修复
zh_hant: 版本 3.0.2 2023年7月15日 • 錯誤修正

# v3.1.0_text
source: Version 3.1 November 20, 2023 • Swipe down or pinch the image to return to the album when viewing individual photos or videos • Watch a video stored on your Piwigo while you use other apps. • Bug fixes
ar: الصيغة 3.0 20 نوفمبر 2023 • السحب للأسفل أو تثبيت الصورة للعودة إلى الألبوم عند مشاهدة صور فردية أو فيديوهات • مشاهدة فيديو مخزن على Piwigo الخاص بك بينما تستخدم تطبيقات أخرى. • إصلاحات الشوائب
da: Version 3.1 20 november 2023 • Stryg nedad eller klem billedet for at vende tilbage til albummet, når du ser individuelle billeder eller videoer • Se en video, der er gemt på din Piwigo, mens du bruger andre apps. • Fejlrettelser
de: Version 3.1 20. November 2023 • Wischen Sie nach unten oder halten Sie das Bild fest, um zum Album zurückzukehren, wenn Sie einzelne Fotos oder Videos ansehen • Sehen Sie sich ein auf Ihrem Piwigo gespeichertes Video an, während Sie andere Anwendungen nutzen. • Fehlerbehebungen
es: Versión 3.1 20 de noviembre de 2023 • Desliza hacia abajo o pellizca la imagen para volver al álbum al ver fotos o vídeos individuales • Mira un vídeo almacenado en tu Piwigo mientras usas otras aplicaciones • Corrección de errores
fr: Version 3.1 20 novembre 2023 • Balayez vers le bas ou pincez l'image pour revenir à l'album lors de la visualisation de photos ou vidéos individuelles • Regarder une vidéo stockée sur votre Piwigo pendant que vous utilisez d'autres applications • Corrections de bogues
hu: 3.1 verzió 2023 November 20 • Az egyes fényképek vagy videók megtekintésekor a képet lefelé húzva vagy megcsípve visszatérhet az albumba. • Nézzen meg egy Piwigo-n tárolt videót, miközben más alkalmazásokat használ. • Hibajavítások
it: Versione 3.1 20 novembre 2023 • Scorri verso il basso o pizzichi l'immagine per tornare all'album durante la visualizzazione di singole foto o video • Guarda un video memorizzato sul tuo Piwigo mentre usi altre applicazioni. • Correzioni di bug
ja: バージョン3.1 2023年11月20日 • 個々の写真やビデオを見るときは、画像を下にスワイプするかピンチしてアルバムに戻ります。 • Piwigoに保存されているビデオを、他のアプリを使用しながら見ることができます。 • バグ修正
nl: Versie 3.1 20 November 2023 • Veeg naar beneden of zet de afbeelding om terug te keren naar het album bij het bekijken van individuele foto's of video's • Bekijk een video die is opgeslagen op uw Piwigo terwijl u andere apps gebruikt. • Foutjes verbeterd
pl: Wersja 3.1 20 listopada 2023 • Przesuń palcem w dół lub zsuń obraz, aby powrócić do albumu podczas przeglądania pojedynczych zdjęć lub filmów. • Oglądaj wideo przechowywane na twoim Piwigo podczas korzystania z innych aplikacji. • Poprawki błędów
ru: Версия 3.1 20 ноября 2023 • Проведите пальцем вниз или зажмите изображение, чтобы вернуться в альбом при просмотре отдельных фотографий или видео. • Просмотр видео, сохраненного на Piwigo, во время работы с другими приложениями. • Исправления ошибок
sv: Version 3.1 20 november 2023 • Svep nedåt eller nypa bilden för att återgå till albumet när du visar enskilda foton eller videor • Titta på en video som lagras på din Piwigo medan du använder andra appar. • Felrättelser
zh_hans: 版本 3.1 2023年11月20日 • 查看单张照片或视频时，向下轻扫或捏住图片即可返回相册 • 在使用其他应用程序时观看存储在 Piwigo 中的视频。 • 错误修复
zh_hant: 版本 3.1 2023年11月20日 • 當觀看相片或影片時向下滑或用雙指縮小圖片以回歸到相簿 • 在使用其他應用程式的同時觀看儲存在Piwigo的影片 • 錯誤修正

# v3.1.1_text
source: Version 3.1.1 December 1, 2023 • Updates server statistics (requires Piwigo 14) • Bug fixes
ar: الإصدار 3.1.1 1 كانون الأول/ديسمبر 2023 • تحديث إحصائيات الخادم (يتطلب Piwigo 14) • إصلاحات الشوائب
da: Version 3.1.1 1 december 2023 • Opdaterer serverstatistikker (kræver Piwigo 14) • Fejlrettelser
de: Version 3.1.1 1. Dezember 2023 • Aktualisiert Serverstatistiken(erfordert Piwigo 14) • Fehlerbehebungen
es: Versión 3.1.1 1 de diciembre de 2023 • Actualiza el servidor de estadísticas (requiere Piwigo 14) • Correcciones de errores
fr: Version 3.1.1 1 décembre 2023 • Met à jour les statistiques du serveur (nécessite Piwigo 14) • Corrections de bugs
hu: 3.1.1 verzió 2023 December 1 • Szerver statisztikák frissítése (Piwigo 14 szükséges) • Hibajavítások
it: Versione 3.1.1 1 dicembre 2023 • Aggiorna le statistiche del server (richiede Piwigo 14) • Correzioni di bug
ja: バージョン 3.1.1 2023年12月1日 • サーバーの統計情報を更新(Piwigo 14が必要) • バグの修正
nl: Versie 3.1.1 1 December 2023 • Serverstatistieken bijwerken (vereist Piwigo 14) • Foutjes verbeterd
pl: Wersja 3.1.1 1 grudnia 2023 • Aktualizacja statystyk serwera (wymaga Piwigo 14) • Poprawki błędów
ru: Версия 3.1.1 1 февраля 2023 • Обновления статистики сервера (требует Piwigo 14) • Исправления ошибок
sv: Version 3.1.1 1 december 2023 • Uppdaterar serverstatistik (kräver Piwigo 14) • Felrättelser
zh_hans: 版本 3.1.1 2023年12月1日 • 更新服务器统计(需要 Piwigo 14) • Bug 修复
zh_hant: 版本 3.1.1 2023年12月1日 • 更新伺服器統計數據 (需要 Piwigo 14) • 錯誤修正

# v3.1.2_text
source: Version 3.1.2 February 1, 2024 • Requests Piwigo server update if necessary • Bug fixes
ar: الإصدار 3.1.2 • طلبات تحديث خادم Piwigo إذا لزم الأمر • إصلاحات الشوائب
da: Version 3.1.2 1 februar 2024 • Anmoder om opdatering af Piwigo server om nødvendigt • Fejlrettelser
de: Version 3.1.2 1. Februar 2024 • Erfordert das Piwigo Server Update falls erforderlich • Fehlerbehebungen
es: Versión 3.1.2 1 de febrero de 2024 • Solicita la actualización del servidor Piwigo si es necesario • Corrección de errores
fr: Version 3.1.2 1 février 2024 • Demande la mise à jour du serveur Piwigo si nécessaire • Corrections de bugs
hu: 3.1.2 verzió 2024 Február 1 • Szükség esetén kéri a Piwigo szerver frissítését • Hibajavítások
it: Versione 3.1.2 1 febbraio 2024 • Richiede l'aggiornamento del server Piwigo se necessario • Correzioni di bug
ja: バージョン 3.1.2 2024年2月1日 • 必要に応じて Piwigo サーバーの更新を要求します • バグの修正
nl: Versie 3.1.2 1 februari 2024 • Verzoeken Piwigo server update indien nodig • Foutjes verbeterd
pl: Wersja 3.1.2 1 lutego 2024 • Żądanie aktualizacji serwera Piwigo w razie potrzeby • Poprawki błędów
ru: Версия 3.1.2 1 февраля 2024 • Запрос обновления Piwigo сервера при необходимости • Исправления ошибок
sv: Version 3.1.2 1 februari 2024 • Begär Piwigo server uppdatering om det behövs • Felrättelser
zh_hans: 版本 3.1.2 2024年2月1日 • 如有必要，请求 Piwigo 服务器更新 • Bug修复
zh_hant: 版本 3.1.2 2024年2月1日 • 如有必要，提示需要更新 Piwigo 伺服器 • Bug修復

# v3.1.3_text
source: Version 3.1.3 February 11, 2024 • Bug fixes
ar: الإصدار 3.1.3 11 فبراير 2024 • إصلاحات الأخطاء
da: Version 3.1.3 11 februar 2024 • Fejlrettelser
de: Version 3.1.3 11. Februar 2024 • Fehlerbehebungen
es: Versión 3.1.3 11 de febrero de 2024 • Corrección de errores
fr: Version 3.1.3 11 février 2024 • Correction de bugs
hu: 3.1.3-es verzió 2024 Február 11 • Hibajavítások
id: Versi 3.1.3 • Perbaikan bug
it: Versione 3.1.3 11 febbraio 2024 • Correzioni di bug
ja: バージョン 3.1.3 2024年2月11日 • バグの修正
nl: Versie 3.1.3 11 februari 2024 • Foutjes verbeterd
pl: Wersja 3.1.3 11 lutego 2024 • Poprawki błędów
ru: Версия 3.1.3 11 февраля 2024 • Исправления ошибок
sv: Version 3.1.3 11 februari 2024 • Buggfixar
zh_hans: 版本 3.1.3 2024年2月11日 • 错误修复
zh_hant: 版本 3.1.3 2024年2月11日 • 錯誤修正

# v3.1.4_text
source: Version 3.1.4 February 27, 2024 • Fixes a crash occurring on iOS 12
ar: الإصدار 3.1.4 27 فبراير 2024 • يصلح تحطم يحدث على iOS 12
da: Version 3.1.4 27 februar 2024 • Retter et nedbrud på iOS 12
de: Version 3.1.4 27. Februar 2024 • Behebt einen Absturz, der unter iOS 12 auftrat
es: Versión 3.1.4 27 de febrero de 2024 • Corrige un bloqueo que se produce en iOS 12
fr: Version 3.1.4 27 février 2024 • Corrige un plantage survenant sur iOS 12
hu: 3.1.4 verzió 2024 Február 27 • Kijavítja az iOS 12 rendszeren előforduló összeomlást
it: Versione 3.1.4 27 febbraio 2024 • Risolve un arresto anomalo che si verificava su iOS 12
ja: バージョン 3.1.4 2024年2月27日 • iOS 12で発生するクラッシュを修正
nl: Versie 3.1.4 27 februari 2024 • Oplossing voor een crash die zich voordeed op iOS 12
pl: Wersja 3.1.4 27 lutego 2024 • Naprawa awarii występującej w systemie iOS 12
ru: Версия 3.1.4 27 февраля 2024 • Исправлен сбой в iOS 12
sv: Version 3.1.4 27 februari 2024 • Åtgärdar en krasch som inträffar på iOS 12
zh_hans: 版本 3.1.4 2024年2月27日 • 修复在 iOS 12 上发生的崩溃问题
zh_hant: 版本3.1.4 2024年2月27日 • 修正了 iOS 12 上發生的崩潰
